cis110rant.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hello World Assignment for Introductory Programmers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Hello World Assignment for Introductory Programmers"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-08 14:36:36 EST"/>
<meta name="author" content="Mishal Awadah"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../assets/css/stylesheet.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Hello World Assignment for Introductory Programmers</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Jackson Five (Hello World)</a>
<ul>
<li><a href="#sec-2-1">Java</a></li>
<li><a href="#sec-2-2">Python</a></li>
<li><a href="#sec-2-3">C</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>  This is a sampling of what the first homework assignment for a computer
  science student would look like under different language
  implementations. I give my opinion on each by
  line number below.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Jackson Five (Hello World)</h2>
<div class="outline-text-2" id="text-2">

<p>  The task is to make a program that takes five command line arguments
  and prints out a proper sentence with the arguments in the reverse order.
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Java</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-java"><span class="linenr">1:  </span>public class HiFive {
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>    public static void main(String[] args) {
<span class="linenr">4:  </span>        System.out.println(args[4] + <span style="color: #cc9393;">", "</span> + args[3] + <span style="color: #cc9393;">", "</span> + args[2] +
<span class="linenr">5:  </span>        <span style="color: #cc9393;">", "</span> + args[1] + <span style="color: #cc9393;">", and "</span> + args[0] + <span style="color: #cc9393;">" formed the original</span>
<span class="linenr">6:  </span><span style="color: #cc9393;">        Jackson 5."</span>); }
<span class="linenr">7:  </span>
<span class="linenr">8:  </span>}
</pre>


<dl>
<dt>1</dt><dd>The declaration of a class in this context is completely
           irrelevant. Moreover, it draws attention away from what is
           actually happening.
</dd>
<dt>3</dt><dd>As a result of forced OOP, the Java main method requires
           a <code>static</code> declaration.
</dd>
<dt>4</dt><dd><code>System.out.println()</code> cannot be properly understood at this
            stage. It is simply the equivalent of <code>print</code> for the time
            being.            
</dd>
<dt>1,3</dt><dd>The use of the <code>public</code> keyword further obfuscates the
             meaning behind the code.
</dd>
</dl>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Python</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="src src-python"><span class="linenr">1:  </span>import sys
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>def main():
<span class="linenr">4:  </span>    print <span style="color: #cc9393;">'{}, {}, {}, {}, and {} formed the original Jackson 5.'</span>.format(
<span class="linenr">5:  </span>        sys.argv[5], sys.argv[4], sys.argv[3], sys.argv[2], sys.argv[1])
<span class="linenr">6:  </span>
<span class="linenr">7:  </span>if __name__ == <span style="color: #cc9393;">'__main__'</span>:
<span class="linenr">8:  </span>    main()
</pre>


<dl>
<dt>1</dt><dd>Using an import statement this early can be difficult to
          understand, however Python places no restrictions on
          header/source files like C. Eventually, students will need
          to learn how to import modules.
</dd>
<dt>3</dt><dd>Unlike C-style languages, <code>main</code> need not take arguments.
</dd>
<dt>7,8</dt><dd>To Python's chagrin, these lines are the true equivalent
            of a "Main Method" which could cause confusion.
</dd>
</dl>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">C</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="src src-c"><span class="linenr">1:  </span>#include &lt;stdio.h&gt;
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>main(int argc, char *argv[]) {
<span class="linenr">4:  </span>    printf(<span style="color: #cc9393;">"%s, %s, %s, %s, and %s formed the original Jackson 5.\n"</span>,
<span class="linenr">5:  </span>           argv[5], argv[4], argv[3], argv[2], argv[1]);
<span class="linenr">6:  </span>}
</pre>


<dl>
<dt>1</dt><dd>Again, the include statement begs for more discussion. With
          C however, it's a little more complicated because there is a
          distinction between header and source files.
</dd>
<dt>3</dt><dd>Unlike Java, a function need not have a type if it is
          void. I find this makes it easier to narrow the scope of
          learning at this stage, and defer return types to a later
          stage of the introduction when they become relevant.
</dd>
<dt>3</dt><dd>Unfortunately, pointers rear their heads even in the most
          basic of programs, so some explanation of <code>*</code> in this
          context will be required, and may be confusing, but students
          should not have to deal with pointer types other than
          strings for quite some time.
</dd>
<dt>4</dt><dd>Format strings are unavoidable in this context, but I
          believe they are useful enough to present themselves early
          on.
</dd>
</dl>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-08 14:36:36 EST</p>
<p class="author">Author: Mishal Awadah</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
